<a href="https://colab.research.google.com/github/JeromeCheon/gcs_AIproject/blob/master/instructions/2nd_Pandas_tutorial_for_beginner.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas Tutorial** <a id="0"></a>

# **What is the pandas?** <a id="2"></a>
<mark>[Return Contents](#0)
<hr>

pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

pandas is a NumFOCUS sponsored project. This will help ensure the success of development of pandas as a world-class open-source project, and makes it possible to donate to the project.

# **Import Library** <a id="3"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
import numpy as np # linear algebra
import pandas as pd # import in pandas

import os
print(os.listdir("./sample_data"))
# os.listdir('./sample_data/california_housing_train')

['anscombe.json', 'README.md', 'mnist_test.csv', 'mnist_train_small.csv', 'california_housing_test.csv', 'california_housing_train.csv']

# **Pandas Data Structure** <a id="4"></a>
<mark>[Return Contents](#0)
<hr>

Pandas has two types of data structures. These are series and dataframe.

### **Series** <a id="5"></a>

The series is a one-dimensional labeled array. It can accommodate any type of data in it.

In [ ]:
mySeries = pd.Series([3,-5,7,4], index=['a','b','c','d'])
type(mySeries)

pandas.core.series.Series

### **DataFrame** <a id="6"></a>

The dataframe is a two-dimensional data structure. It contains columns.

In [ ]:
data = {'Country' : ['Belgium', 'India', 'Brazil' ],
        'Capital': ['Brussels', 'New Delhi', 'Brassilia'],
        'Population': [1234,1234,1234]}
datas = pd.DataFrame(data, columns=['Country','Capital','Population'])
print(type(data))
print(type(datas))

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

# **Import Library** <a id="7"></a>
<mark>[Return Contents](#0)
<hr>

With pandas, we can open CSV, Excel and SQL databases. I will show you how to use this method for CSV and Excel files only.

### **CSV(comma - separated values)** <a id="8"></a>

It is very easy to open and read CSV files and to overwrite the CSV file.

In [ ]:
df = pd.read_csv('./sample_data/california_housing_train.csv')
type(df)
# If your Python file is not in the same folder as your CSV file, you should do this as follows.
# df = pd.read_csv('/home/desktop/Iris.csv')

pandas.core.frame.DataFrame

### **Excel** <a id="9"></a>

When we want to work with Excel files, we need to type the following code.

In [ ]:
# pd.read_excel('filename')
# pd.to_excel('dir/dataFrame.xlsx', sheet_name='Sheet1')

### **Others(json, SQL, table, html)** <a id="10"></a>

In [ ]:
# pd.read_sql(query,connection_object) -> Reads from a SQL table/database
# pd.read_table(filename) -> From a delimited text file(like TSV)
# pd.read_json(json_string) -> Reads from a json formatted string, URL or file
# pd.read_html(url) -> Parses an html URL, string or file and extracts tables to a list of dataframes
# pd.read_clipboard() -> Takes the contentes of your clipboard and passes it to read_table()
# pd.DataFrame(dict) -> From a dict, keys for columns names, values for data as lists

# **Exporting Data** <a id="11"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
# df.to_csv(filename) -> Writes to a CSV file
# df.to_excel(filename) -> Writes on an Excel file
# df.to_sql(table_name, connection_object) -> Writes to a SQL table
# df.to_json(filename) -> Writes to a file in JSON format
# df.to_html(filename) -> Saves as an HTML table
# df.to_clipboard() -> Writes to the clipboard

# **Create Test Objects** <a id="12"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
pd.DataFrame(np.random.rand(20,5)) # 5 columns and 20 rows of random floats

           0         1         2         3         4
0   0.140667  0.441477  0.738782  0.971723  0.245822
1   0.822632  0.653322  0.832708  0.902521  0.759869
2   0.099325  0.907436  0.251987  0.892479  0.428663
3   0.960666  0.652649  0.703919  0.361877  0.131625
4   0.567076  0.933775  0.906584  0.182230  0.140333
5   0.463226  0.120056  0.033154  0.931688  0.247157
6   0.399374  0.347554  0.554090  0.459794  0.647230
7   0.941602  0.457928  0.307894  0.168446  0.045849
8   0.641014  0.873669  0.368126  0.453964  0.111511
9   0.787512  0.506257  0.341974  0.422327  0.984308
10  0.032391  0.828348  0.806197  0.150905  0.234855
11  0.448876  0.307708  0.747134  0.264298  0.967136
12  0.472805  0.080612  0.724535  0.069600  0.917210
13  0.384924  0.490690  0.287430  0.077702  0.732502
14  0.685956  0.801111  0.836703  0.036652  0.188851
15  0.324063  0.273532  0.540468  0.294587  0.566295
16  0.539197  0.046889  0.294060  0.532738  0.402324
17  0.450286  0.346433  0.785531  0.937179  0.372747
18  0.605103  0.649494  0.007687  0.244214  0.492102
19  0.848415  0.411651  0.115110  0.236019  0.519674

# **Summarize Data** <a id="13"></a>
<mark>[Return Contents](#0)
<hr>

It's easy to get information about data with pandas. It makes it easier for us. Let's examine the existing functions one by one

### **df.info()** <a id="14"></a>
This Code provides detailed information about our data.

* **RangeIndex:** Specifies how many data there is.
* **Data Columns:** Specifies how many columns are found.
* **Columns:** Gives information about Columns.
* **dtypes:** It says what kind of data you have and how many of these data you have.
* **Memory Usage:** It says how much memory usage is.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

### **df.shape()** <a id="15"></a>
This code shows us the number of rows and columns.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.shape

(17000, 9)

### **df.index** <a id="16"></a>
This code shows the total number of index found.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.index

RangeIndex(start=0, stop=17000, step=1)

### **df.columns** <a id="17"></a>
This code shows all the columns contained in the data we have examined.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

### **df.count()** <a id="18"></a>
This code shows us how many pieces of data are in each column.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.count()

longitude             17000
latitude              17000
housing_median_age    17000
total_rooms           17000
total_bedrooms        17000
population            17000
households            17000
median_income         17000
median_house_value    17000
dtype: int64

### **df.sum()** <a id="19"></a>
This code shows us the sum of the data in each column.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.sum()

longitude            -2.032556e+06
latitude              6.056288e+05
housing_median_age    4.860190e+05
total_rooms           4.494230e+07
total_bedrooms        9.169984e+06
population            2.430276e+07
households            8.520773e+06
median_income         6.602083e+04
median_house_value    3.524116e+09
dtype: float64

### **df.cumsum()** <a id="20"></a>
This code gives us cumulative sum of the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.cumsum().head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -228.78     68.59  ...         3.3136            147000.0
2    -343.34    102.28  ...         4.9645            232700.0
3    -457.91    135.92  ...         8.1562            306100.0
4    -572.48    169.49  ...        10.0812            371600.0

[5 rows x 9 columns]

### **df.min()** <a id="21"></a>
This code brings us the smallest of the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.min()

longitude              -124.3500
latitude                 32.5400
housing_median_age        1.0000
total_rooms               2.0000
total_bedrooms            1.0000
population                3.0000
households                1.0000
median_income             0.4999
median_house_value    14999.0000
dtype: float64

### **df.max()** <a id="22"></a>
This code brings up the largest among the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.max()

longitude               -114.3100
latitude                  41.9500
housing_median_age        52.0000
total_rooms            37937.0000
total_bedrooms          6445.0000
population             35682.0000
households              6082.0000
median_income             15.0001
median_house_value    500001.0000
dtype: float64

### **idxmin()**  <a id="23"></a>
This code fetches the smallest value in the data. The use on series and dataframe is different.

<mark>[Return Contents](#0)
<hr>

In [ ]:
print("df: ",df['total_rooms'].idxmin())
print("series", mySeries.idxmin())

df:  2990
series b

### **idxmax()**  <a id="24"></a>
This code returns the largest value in the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
print("df: ",df['total_rooms'].idxmax())
print("series: ",mySeries.idxmax())

df:  2871
series:  c

### **df.describe()**  <a id="25"></a>
This Code provides basic statistical information about the data. The numerical column is based.

* **count:** vnumber of entries
* **mean: **average of entries
* **std:** standart deviation
* **min:** minimum entry
* **25%:** first quantile
* **50%:** median or second quantile
* **75%:** third quantile
* **max:** maximum entry

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.describe()

          longitude      latitude  ...  median_income  median_house_value
count  17000.000000  17000.000000  ...   17000.000000        17000.000000
mean    -119.562108     35.625225  ...       3.883578       207300.912353
std        2.005166      2.137340  ...       1.908157       115983.764387
min     -124.350000     32.540000  ...       0.499900        14999.000000
25%     -121.790000     33.930000  ...       2.566375       119400.000000
50%     -118.490000     34.250000  ...       3.544600       180400.000000
75%     -118.000000     37.720000  ...       4.767000       265000.000000
max     -114.310000     41.950000  ...      15.000100       500001.000000

[8 rows x 9 columns]

### **df.mean()**  <a id="26"></a>
This code returns the mean value for the numeric column.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.mean()

longitude               -119.562108
latitude                  35.625225
housing_median_age        28.589353
total_rooms             2643.664412
total_bedrooms           539.410824
population              1429.573941
households               501.221941
median_income              3.883578
median_house_value    207300.912353
dtype: float64

### **df.median()**  <a id="27"></a>
This code returns median for columns with numeric values.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.median()

longitude               -118.4900
latitude                  34.2500
housing_median_age        29.0000
total_rooms             2127.0000
total_bedrooms           434.0000
population              1167.0000
households               409.0000
median_income              3.5446
median_house_value    180400.0000
dtype: float64

### **df.quantile([0.25,0.75])**  <a id="28"></a>
This code calculates the values 0.25 and 0.75 of the columns for each column.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.quantile([0.25,0.75])

      longitude  latitude  ...  median_income  median_house_value
0.25    -121.79     33.93  ...       2.566375            119400.0
0.75    -118.00     37.72  ...       4.767000            265000.0

[2 rows x 9 columns]

### **df.var()**  <a id="29"></a>
This code calculates the variance value for each column with a numeric value.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.var()

longitude             4.020692e+00
latitude              4.568221e+00
housing_median_age    1.584310e+02
total_rooms           4.752169e+06
total_bedrooms        1.776618e+05
population            1.317566e+06
households            1.478563e+05
median_income         3.641061e+00
median_house_value    1.345223e+10
dtype: float64

### **df.std()** <a id="30"></a>
This code calculates the standard deviation value for each column with numeric value.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.std()

longitude                  2.005166
latitude                   2.137340
housing_median_age        12.586937
total_rooms             2179.947071
total_bedrooms           421.499452
population              1147.852959
households               384.520841
median_income              1.908157
median_house_value    115983.764387
dtype: float64

### **df.cummax()** <a id="31"></a>
This code calculates the cumulative max value between the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.cummax()

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.31     34.40  ...         1.8200             80100.0
2        -114.31     34.40  ...         1.8200             85700.0
3        -114.31     34.40  ...         3.1917             85700.0
4        -114.31     34.40  ...         3.1917             85700.0
...          ...       ...  ...            ...                 ...
16995    -114.31     41.95  ...        15.0001            500001.0
16996    -114.31     41.95  ...        15.0001            500001.0
16997    -114.31     41.95  ...        15.0001            500001.0
16998    -114.31     41.95  ...        15.0001            500001.0
16999    -114.31     41.95  ...        15.0001            500001.0

[17000 rows x 9 columns]

### **df.cummin()** <a id="32"></a>
This code returns the cumulative min value of the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.cummin()

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.19  ...         1.4936             66900.0
2        -114.56     33.69  ...         1.4936             66900.0
3        -114.57     33.64  ...         1.4936             66900.0
4        -114.57     33.57  ...         1.4936             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     32.54  ...         0.4999             14999.0
16996    -124.27     32.54  ...         0.4999             14999.0
16997    -124.30     32.54  ...         0.4999             14999.0
16998    -124.30     32.54  ...         0.4999             14999.0
16999    -124.35     32.54  ...         0.4999             14999.0

[17000 rows x 9 columns]

### **df['columnName'].cumproad()** <a id="33"></a>
This code returns the cumulative production of the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df['total_rooms'].cumprod().head()

0    5.612000e+03
1    4.293180e+07
2    3.091090e+10
3    4.639725e+13
4    6.746161e+16
Name: total_rooms, dtype: float64

### **len(df)** <a id="34"></a>
This code gives you how many data there is.

<mark>[Return Contents](#0)
<hr>

In [ ]:
len(df)

17000

### **df.isnull()** <a id="35"></a>
Checks for null values, returns boolean.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.isnull().head()

   longitude  latitude  ...  median_income  median_house_value
0      False     False  ...          False               False
1      False     False  ...          False               False
2      False     False  ...          False               False
3      False     False  ...          False               False
4      False     False  ...          False               False

[5 rows x 9 columns]

### **df.corr()** <a id="81"></a>
it gives information about the correlation between the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.corr()

                    longitude  latitude  ...  median_income  median_house_value
longitude            1.000000 -0.925208  ...      -0.015485           -0.044982
latitude            -0.925208  1.000000  ...      -0.080303           -0.144917
housing_median_age  -0.114250  0.016454  ...      -0.115932            0.106758
total_rooms          0.047010 -0.038773  ...       0.195383            0.130991
total_bedrooms       0.071802 -0.069373  ...      -0.013495            0.045783
population           0.101674 -0.111261  ...      -0.000638           -0.027850
households           0.059628 -0.074902  ...       0.007644            0.061031
median_income       -0.015485 -0.080303  ...       1.000000            0.691871
median_house_value  -0.044982 -0.144917  ...       0.691871            1.000000

[9 rows x 9 columns]

# **Selection & Filtering** <a id="36"></a>
<mark>[Return Contents](#0)
<hr>

This is how we can choose the data we want with pandas, how we can bring unique data.

### **mySeries['b']** <a id="37"></a>
This code returns data with a value of B in series.

<mark>[Return Contents](#0)
<hr>

In [ ]:
mySeries['b']

-5

### **df[n:n]** <a id="38"></a>
This code fetches data from N to N.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df[1982:]
#Or
#df[5:7]

       longitude  latitude  ...  median_income  median_house_value
1982     -117.31     34.11  ...         1.9044             64900.0
1983     -117.31     34.11  ...         1.9375             64100.0
1984     -117.31     34.10  ...         2.0089             68100.0
1985     -117.31     34.09  ...         1.6080             73700.0
1986     -117.31     34.08  ...         1.9234             74600.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[15018 rows x 9 columns]

### **df.iloc[[n],[n]]** <a id="39"></a>
This code brings the data in the N row and N column in the DataFrame.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.iloc[[0],[3]]

   total_rooms
0       5612.0

### **df.loc[n:n]** <a id="40"></a>
This code allows us to fetch the data in the range we specify.

<mark>[Return Contents](#0)
<hr>

In [ ]:
#df.loc[n:]
# OR
df.loc[5:7]

   longitude  latitude  ...  median_income  median_house_value
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0

[3 rows x 9 columns]

### **df['columnName']** <a id="41"></a>
With this code, we can select and bring any column we want.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df['total_rooms'].head()
# OR
# df.Open

0    5612.0
1    7650.0
2     720.0
3    1501.0
4    1454.0
Name: total_rooms, dtype: float64

### **df['columnName'][n]** <a id="42"></a>
With this code, we can select and return any value of the column we want.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df['total_rooms'][0]
# OR
# df.Open[0]
# df["Open"][1]
# df.loc[1,["Open"]]

5612.0

### **df['columnName'].nunique()** <a id="43"></a>
This code shows how many of the data that is in the selected column and does not repeat.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df['total_rooms'].nunique()

5533

### **df['columnName'].unique()** <a id="44"></a>
This code shows which of the data in the selected column repeats.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df['total_rooms'].unique()
# We can write the above code as follows:: df.Open.unique()

array([5612., 7650.,  720., ..., 3810., 3003., 2694.])

### **df.columnName** <a id="45"></a>
This code is another way to select the column we want.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.total_rooms.head()

0    5612.0
1    7650.0
2     720.0
3    1501.0
4    1454.0
Name: total_rooms, dtype: float64

### **df['columnName'].value_counts(dropna =False)** <a id="46"></a>
This code counts all of the data in the column we have specified, but does not count the null/none values.

<mark>[Return Contents](#0)
<hr>

In [ ]:
print(df.total_rooms.value_counts(dropna =True).head())
# OR
# print(df['Item'].value_counts(dropna =False))

1582.0    16
1527.0    15
1717.0    14
1471.0    14
1703.0    14
Name: total_rooms, dtype: int64

### **df.head(n)** <a id="47"></a>
This code optionally brings in the first 5 data. returns the number of data that you type instead of N.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.head()
# OR
# df.head(15)

### **df.tail(n)** <a id="48"></a>
This code optionally brings 5 data at the end. returns the number of data that you type instead of N.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.tail()
# OR
# df.tail(20)

       longitude  latitude  ...  median_income  median_house_value
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[5 rows x 9 columns]

### **df.sample(n)** <a id="49"></a>
This code fetches random n data from the data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.sample(5)

       longitude  latitude  ...  median_income  median_house_value
5366     -118.15     34.04  ...         3.7794            194600.0
698      -117.05     33.01  ...        10.6186            429300.0
3096     -117.82     33.89  ...         4.0714            278900.0
8369     -118.46     34.00  ...         5.1664            326700.0
12474    -121.61     37.03  ...         5.6754            298500.0

[5 rows x 9 columns]

### **df.sample(frac=0.5)** <a id="50"></a>
This code selects the fractions of random rows and fetches the data to that extent.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.sample(frac=0.5).head()

       longitude  latitude  ...  median_income  median_house_value
16698    -122.82     38.39  ...         3.6250            233700.0
13906    -122.03     37.69  ...         6.5000            340000.0
8840     -118.71     34.29  ...         6.3236            302000.0
865      -117.08     33.82  ...         4.0650            148200.0
321      -116.87     32.72  ...         5.7652            259900.0

[5 rows x 9 columns]

### **df.nlargest(n,'columnName')** <a id="51"></a>
This code brings N from the column where we have specified the largest data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.nlargest(5,'total_rooms')

       longitude  latitude  ...  median_income  median_house_value
2871     -117.74     33.89  ...         7.4947            366300.0
12772    -121.79     36.64  ...         2.3087            118800.0
2969     -117.78     34.03  ...         6.0191            253900.0
8881     -118.78     34.16  ...         8.0137            399200.0
1116     -117.12     33.52  ...         4.5841            212300.0

[5 rows x 9 columns]

### **df.nsmallest(n,'columnName')** <a id="52"></a>
This code brings N from the column where we have specified the smallest data.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.nsmallest(3,'total_rooms')

       longitude  latitude  ...  median_income  median_house_value
2990     -117.79     35.21  ...         2.3750            137500.0
16309    -122.50     37.79  ...        15.0001            500001.0
8188     -118.44     34.28  ...         2.8750            162500.0

[3 rows x 9 columns]

### **df[df.columnName < 5]** <a id="53"></a>
This code returns the column name we have specified, which is less than 5.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df[df.total_rooms > 18281.949219]

       longitude  latitude  ...  median_income  median_house_value
186      -116.33     33.75  ...         4.0360            158500.0
1116     -117.12     33.52  ...         4.5841            212300.0
1321     -117.16     33.57  ...         3.9443            187300.0
1408     -117.18     32.95  ...         6.3237            260900.0
1444     -117.19     33.90  ...         4.1890            143000.0
1514     -117.21     33.97  ...         5.6409            197700.0
1836     -117.27     33.68  ...         5.3238            228900.0
1838     -117.27     33.23  ...         4.1405            198500.0
1920     -117.29     33.97  ...         4.6667            160600.0
2001     -117.31     33.19  ...         4.3762            215500.0
2274     -117.42     33.35  ...         2.5729            134400.0
2434     -117.59     34.13  ...         3.8505            169600.0
2464     -117.61     34.10  ...         3.6033            132600.0
2871     -117.74     33.89  ...         7.4947            366300.0
2897     -117.75     34.01  ...         6.1287            289600.0
2969     -117.78     34.03  ...         6.0191            253900.0
2995     -117.79     34.02  ...         6.4266            315600.0
3058     -117.81     34.08  ...         7.7876            348900.0
3131     -117.83     33.97  ...         7.0329            368300.0
3296     -117.87     34.04  ...         6.6288            339700.0
3359     -117.88     33.96  ...         5.5469            265200.0
4771     -118.09     34.68  ...         4.0211            144000.0
4856     -118.10     34.57  ...         3.3086            138100.0
8092     -118.43     34.43  ...         4.2037            194600.0
8319     -118.46     34.40  ...         4.5420            195300.0
8655     -118.55     34.41  ...         5.8602            265100.0
8847     -118.72     34.14  ...         5.4032            318500.0
8881     -118.78     34.16  ...         8.0137            399200.0
8959     -118.90     34.26  ...         6.9712            321300.0
11803    -121.33     38.77  ...         4.2259            169300.0
11864    -121.35     38.72  ...         4.5432            151300.0
12018    -121.40     38.47  ...         4.3658            130600.0
12586    -121.68     36.72  ...         3.2652            152800.0
12772    -121.79     36.64  ...         2.3087            118800.0
13299    -121.92     37.53  ...         8.4045            451100.0
14608    -122.17     38.08  ...         6.4232            229200.0
15001    -122.24     37.72  ...         7.6110            350700.0

[37 rows x 9 columns]

### **df[['columnName','columnName']]** <a id="54"></a>
This code helps us pick and bring any columns we want.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df[['total_rooms','total_bedrooms']].head()
# df.loc[:,['total_rooms','total_bedrooms']]

   total_rooms  total_bedrooms
0       5612.0          1283.0
1       7650.0          1901.0
2        720.0           174.0
3       1501.0           337.0
4       1454.0           326.0

### **df.loc[:,"columnName1":"columnName2"]** <a id="55"></a>
This code returns columns from columnname1 to columnname2.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.loc[:,"total_rooms":"total_bedrooms"].head()
# OR
# data.loc[:3,"total_rooms":"total_bedrooms"]

   total_rooms  total_bedrooms
0       5612.0          1283.0
1       7650.0          1901.0
2        720.0           174.0
3       1501.0           337.0
4       1454.0           326.0

### **Create Filter** <a id="56"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
filters = df.total_bedrooms > 1000
df[filters]

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
8        -114.59     33.61  ...         2.1782             58400.0
115      -115.85     34.20  ...         1.3571             41000.0
133      -116.06     34.15  ...         2.2466             66800.0
...          ...       ...  ...            ...                 ...
16824    -123.22     39.28  ...         3.1455            142900.0
16838    -123.34     39.10  ...         3.0652            131100.0
16854    -123.49     38.70  ...         3.3125            295400.0
16859    -123.59     38.80  ...         3.1201            176100.0
16986    -124.19     40.73  ...         3.5363             90100.0

[1576 rows x 9 columns]

### **np.logical_and** <a id="58"></a>
Filtering with logical_and. Lets look at the example.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df[np.logical_and(df['latitude']>40.73, df['median_house_value']>80100.0 )]

       longitude  latitude  ...  median_income  median_house_value
11228    -121.07     40.85  ...         3.6641             80800.0
12025    -121.41     40.82  ...         2.3393             90300.0
12212    -121.47     41.12  ...         2.8300             88700.0
12525    -121.64     40.90  ...         1.7538             90300.0
15255    -122.28     41.38  ...         2.8036            110100.0
...          ...       ...  ...            ...                 ...
16974    -124.17     40.77  ...         2.2227             81300.0
16975    -124.17     40.76  ...         2.8056             82800.0
16976    -124.17     40.75  ...         4.8516            116100.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0

[68 rows x 9 columns]

### **Filtering with &** <a id="59"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
df[(df['latitude']>40.73) & (df['median_house_value']>80100.0)]

       longitude  latitude  ...  median_income  median_house_value
11228    -121.07     40.85  ...         3.6641             80800.0
12025    -121.41     40.82  ...         2.3393             90300.0
12212    -121.47     41.12  ...         2.8300             88700.0
12525    -121.64     40.90  ...         1.7538             90300.0
15255    -122.28     41.38  ...         2.8036            110100.0
...          ...       ...  ...            ...                 ...
16974    -124.17     40.77  ...         2.2227             81300.0
16975    -124.17     40.76  ...         2.8056             82800.0
16976    -124.17     40.75  ...         4.8516            116100.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0

[68 rows x 9 columns]

# **Sort Data** <a id="60"></a>

<mark>[Return Contents](#0)
<hr>

### **df.sort_values('columnName')** <a id="61"></a>
This code sorts the column we specify in the form of low to high.

In [ ]:
df.sort_values('median_house_value').head()

       longitude  latitude  ...  median_income  median_house_value
568      -117.02     36.40  ...         2.1000             14999.0
16643    -122.74     39.71  ...         1.6607             14999.0
16801    -123.17     40.31  ...         0.5360             14999.0
3226     -117.86     34.24  ...         4.1932             14999.0
7182     -118.33     34.15  ...         2.3667             17500.0

[5 rows x 9 columns]

### **df.sort_values('columnName', ascending=False)** <a id="62"></a>
This code is the column we specify in the form of high to low.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.sort_values('median_house_value', ascending=False).head()

      longitude  latitude  ...  median_income  median_house_value
8628    -118.53     34.14  ...         9.2189            500001.0
4398    -118.03     34.16  ...         6.6888            500001.0
8653    -118.54     34.05  ...         8.5650            500001.0
8652    -118.54     34.06  ...        11.4233            500001.0
4334    -118.01     33.69  ...        11.5199            500001.0

[5 rows x 9 columns]

### **df.sort_index()** <a id="63"></a>
This code sorts from small to large according to the DataFrame index.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.sort_index().head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

# **Rename & Defining New & Change Columns** <a id="64"></a>
<mark>[Return Contents](#0)
<hr>

### **df.rename(columns= {'columnName' : 'newColumnName'})** <a id="65"></a>
This code helps us change the column name. The code I wrote below changes the ID value, but as we did not assign the change to the variable DF, it seems to be unchanged as you see below.

In [ ]:
df.rename(columns= {'latitude' : 'latitude_'}).head()
# df = df.rename(columns= {'Id' : 'Identif'}, inplace=True) -> True way
# inplace= True or False; This meaning, overwrite the data set.
# Other Way
# df.columns = ['date', 'open', 'high', 'low', 'close', 'volume', 'adjclose']

   longitude  latitude_  ...  median_income  median_house_value
0    -114.31      34.19  ...         1.4936             66900.0
1    -114.47      34.40  ...         1.8200             80100.0
2    -114.56      33.69  ...         1.6509             85700.0
3    -114.57      33.64  ...         3.1917             73400.0
4    -114.57      33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

###  **Defining New Column** <a id="66"></a>
Create a new column

<mark>[Return Contents](#0)
<hr>

In [ ]:
df["Difference"] = df.total_rooms - df.total_bedrooms
df.head()

   longitude  latitude  ...  median_house_value  Difference
0    -114.31     34.19  ...             66900.0      4329.0
1    -114.47     34.40  ...             80100.0      5749.0
2    -114.56     33.69  ...             85700.0       546.0
3    -114.57     33.64  ...             73400.0      1164.0
4    -114.57     33.57  ...             65500.0      1128.0

[5 rows x 10 columns]

### **Change Index Name** <a id="67"></a>
Change index name to new index name

<mark>[Return Contents](#0)
<hr>

In [ ]:
print(df.index.name)
df.index.name = "index_name"
df.head()

None

            longitude  latitude  ...  median_house_value  Difference
index_name                       ...
0             -114.31     34.19  ...             66900.0      4329.0
1             -114.47     34.40  ...             80100.0      5749.0
2             -114.56     33.69  ...             85700.0       546.0
3             -114.57     33.64  ...             73400.0      1164.0
4             -114.57     33.57  ...             65500.0      1128.0

[5 rows x 10 columns]

### **Make all columns lowercase** <a id="68"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
#df.columns = map(str.lower(), df.columns)

### **Make all columns uppercase** <a id="69"></a>
<mark>[Return Contents](#0)
<hr>

In [ ]:
#df.columns = map(str.upper(), df.columns)

# **Drop Data** <a id="70"></a>

<mark>[Return Contents](#0)
<hr>

### **df.drop(columns=['columnName'])** <a id="71"></a>
This code deletes the column we have specified. But as above, I have to reset the delete to the df variable again.

In [ ]:
df.drop(columns=['latitude']).head()
# df = df.drop(columns=['Id']) -> True way
# OR
# df = df.drop('col', axis=1)
# axis = 1 is meaning delete columns
# axis = 0 is meaning delete rows

            longitude  housing_median_age  ...  median_house_value  Difference
index_name                                 ...
0             -114.31                15.0  ...             66900.0      4329.0
1             -114.47                19.0  ...             80100.0      5749.0
2             -114.56                17.0  ...             85700.0       546.0
3             -114.57                14.0  ...             73400.0      1164.0
4             -114.57                20.0  ...             65500.0      1128.0

[5 rows x 9 columns]

### **mySeries.drop(['a'])** <a id="72"></a>
This code allows us to delete the value specified in the series.

<mark>[Return Contents](#0)
<hr>

In [ ]:
mySeries.drop(['a'])

b   -5
c    7
d    4
dtype: int64

### **Drop an observation (row)** <a id="82"></a>

<mark>[Return Contents](#0)
<hr>

In [ ]:
# df.drop(['2016-07-01', '2016-06-27'])

### **Drop a variable (column)** <a id="83"></a>

<mark>[Return Contents](#0)
<hr>
Note: axis=1 denotes that we are referring to a column, not a row

In [ ]:
# df.drop('Volume', axis=1)

# **Convert Data Types** <a id="73"></a>

<mark>[Return Contents](#0)
<hr>

### **df.dtypes** <a id="74"></a>
This code shows what data type of columns are. Boolean, int, float, object(String), date and categorical.

In [ ]:
df.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
Difference            float64
dtype: object

### **df['columnName'] = df['columnName'].astype('dataType')** <a id="75"></a>
This code convert the column we specify into the data type we specify.

<mark>[Return Contents](#0)
<hr>

In [ ]:
df.households.astype(int).dtypes
# OR Convert Datetime
# df.Date= pd.to_datetime(df.Date)

dtype('int64')

# **Apply Function** <a id="77"></a>

<mark>[Return Contents](#0)
<hr>

### **Method 1** <a id="78"></a>

In [ ]:
def examples(x):   #create a function
    return x*2

df.households.apply(examples).head()  #use the function with apply()

index_name
0    944.0
1    926.0
2    234.0
3    452.0
4    524.0
Name: households, dtype: float64

### **Method 2** <a id="79"></a>

In [ ]:
df.households.apply(lambda x: x*2).head()

index_name
0    944.0
1    926.0
2    234.0
3    452.0
4    524.0
Name: households, dtype: float64

# **Utilities Code** <a id="80"></a>

<mark>[Return Contents](#0)
<hr>

In [ ]:
# pd.get_option OR pd.set_option
# pd.reset_option("^display")

# pd.reset_option("display.max_rows")
# pd.get_option("display.max_rows")
# pd.set_option("max_r",102)                 -> specifies the maximum number of rows to display.
# pd.options.display.max_rows = 999          -> specifies the maximum number of rows to display.

# pd.get_option("display.max_columns")
# pd.options.display.max_columns = 999       -> specifies the maximum number of columns to display.

# pd.set_option('display.width', 300)

# pd.set_option('display.max_columns', 300)  -> specifies the maximum number of rows to display.
# pd.set_option('display.max_colwidth', 500) -> specifies the maximum number of columns to display. 

# pd.get_option('max_colwidth')
# pd.set_option('max_colwidth',40)
# pd.reset_option('max_colwidth')

# pd.get_option('max_info_columns')
# pd.set_option('max_info_columns', 11)
# pd.reset_option('max_info_columns')

# pd.get_option('max_info_rows')
# pd.set_option('max_info_rows', 11)
# pd.reset_option('max_info_rows')

# pd.set_option('precision',7) -> sets the output display precision in terms of decimal places. This is only a suggestion.
# OR
# pd.set_option('display.precision',3)

# pd.set_option('chop_threshold', 0) -> sets at what level pandas rounds to zero when it displays a Series of DataFrame. This setting does not change the precision at which the number is stored.
# pd.reset_option('chop_threshold')